### CHECK není implementován v mysql !!!

In [1]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_40582/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [4]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1       funkacernette
2               mysql
3  performance_schema
4              sqlw3s
5                 sys
6              testDB

### SQL CHECK Constraint
The CHECK constraint is used to limit the value range that can be placed in a column.

If you define a CHECK constraint on a column it will allow only certain values for this column.

If you define a CHECK constraint on a table it can limit the values in certain columns based on values in other columns in the row.

SQL CHECK on CREATE TABLE
The following SQL creates a CHECK constraint on the "Age" column when the "Persons" table is created. The CHECK constraint ensures that the age of a person must be 18, or older:

MySQL:

CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CHECK (Age>=18)
);

SQL Server / Oracle / MS Access:
--i postgres:
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int CHECK (Age>=18)
);

To allow naming of a CHECK constraint, and for defining a CHECK constraint on multiple columns, use the following SQL syntax:

MySQL / SQL Server / Oracle / MS Access:
--i postgres:
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    City varchar(255),
    CONSTRAINT CHK_Person CHECK (Age>=18 AND City='Sandnes')
);

In [5]:
pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_40582/1395910305.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

   ID LastName FirstName  Age
0   1    Alice    Palice   16
1   1    Alice    Palice   16

In [19]:
cur.execute('''DROP TABLE testDB.Persons;''')

0

In [20]:
#  NEFUNGUJE CHECK!!!
cur.execute('''CREATE TABLE testDB.Persons ( ID int NOT NULL, LastName varchar(255) NOT NULL, FirstName varchar(255), Age int, CHECK (Age>=18) );''')

0

In [21]:
pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_40582/1395910305.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

Empty DataFrame
Columns: [ID, LastName, FirstName, Age]
Index: []

In [22]:
cur.execute('''INSERT INTO testDB.Persons VALUES (1, 'Alice', 'Palice', 16);''')
conn.commit()

In [23]:
pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_40582/1395910305.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

   ID LastName FirstName  Age
0   1    Alice    Palice   16

Notice that the "PersonID" column in the "Orders" table points to the "PersonID" column in the "Persons" table.

The "PersonID" column in the "Persons" table is the PRIMARY KEY in the "Persons" table.

The "PersonID" column in the "Orders" table is a FOREIGN KEY in the "Orders" table.

The FOREIGN KEY constraint prevents invalid data from being inserted into the foreign key column, because it has to be one of the values contained in the parent table.E TABLE

In [24]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

       Field          Type Null Key Default Extra
0         ID       int(11)   NO        None
1   LastName  varchar(255)   NO        None
2  FirstName  varchar(255)  YES        None
3        Age       int(11)  YES        None

In [25]:
pd.options.display.max_colwidth = 999
# Return data from the Customers table:
cur.execute('''SHOW CREATE TABLE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

,Table,Create Table
0,Persons,"CREATE TABLE `Persons` (\n `ID` int(11) NOT NULL,\n `LastName` varchar(255) NOT NULL,\n `FirstName` varchar(255) DEFAULT NULL,\n `Age` int(11) DEFAULT NULL\n) ENGINE=InnoDB DEFAULT CHARSET=utf8"

In [26]:
pd.options.display.max_colwidth = 999
# Return data from the Customers table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ID LastName FirstName  Age
0   1    Alice    Palice   16

SQL CHECK on ALTER TABLE
To create a CHECK constraint on the "Age" column when the table is already created, use the following SQL:

MySQL / SQL Server / Oracle / MS Access:

ALTER TABLE Persons
ADD CHECK (Age>=18);
To allow naming of a CHECK constraint, and for defining a CHECK constraint on multiple columns, use the following SQL syntax:

MySQL / SQL Server / Oracle / MS Access:

ALTER TABLE Persons
ADD CONSTRAINT CHK_PersonAge CHECK (Age>=18 AND City='Sandnes');

DROP a CHECK Constraint
To drop a CHECK constraint, use the following SQL:

SQL Server / Oracle / MS Access:

ALTER TABLE Persons
DROP CONSTRAINT CHK_PersonAge;

MySQL:

ALTER TABLE Persons
DROP CHECK CHK_PersonAge;


--postgres:
ALTER TABLE public.Persons
DROP CONSTRAINT CHK_Person;

ALTER TABLE public.Persons
ADD CONSTRAINT CHK_PersonAge CHECK (Age>=18 AND City='Sandnes');

In [27]:
cur.execute('''ALTER TABLE testDB.Persons ADD CONSTRAINT CHK_PersonAge CHECK (Age>=18);''')
conn.commit()

In [28]:
cur.execute('''INSERT INTO testDB.Persons VALUES (1, 'Alice', 'Palice', 16);''')
conn.commit()

In [29]:
pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_40582/1395910305.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('''SELECT * FROM testDB.Persons;''', conn)

   ID LastName FirstName  Age
0   1    Alice    Palice   16
1   1    Alice    Palice   16

In [30]:
pd.options.display.max_colwidth = 999
# Return data from the Customers table:
cur.execute('''ANALYZE TABLE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

            Table       Op Msg_type Msg_text
0  testdb.persons  analyze   status       OK